---
kind: type
id: T:Autodesk.Revit.DB.Structure.AreaReinforcement
source: html/889aa3cf-9b32-dd78-b660-bcfbad2cf87e.htm
---
# Autodesk.Revit.DB.Structure.AreaReinforcement

An object that represents an Area Reinforcement within the Autodesk Revit project.

## Syntax (C#)
```csharp
public class AreaReinforcement : Element
```

## Remarks
This object derived from the Element base object and such supports all the
 methods of that object such as the ability to retrieve the parameters of that object.
 The Area Reinforcement element is available only in the Autodesk Revit Structure product.